/**
文件名称：STFDATA.H
版权所有(c)  2009， 同洲电子。
 
@version  Ver 1.0    
@author   龙式荣 (longshirong@coship.com)
@file
		华文字库数据声明
 
History:
版本号		日期		作者		修改内容
---------	     --------        -------   	-------------
1.0			2009-11-20	龙式荣		创建
*/

#ifndef STFDATA_H
#define STFDATA_H

#ifdef __cplusplus
extern "C" {
#endif

/******************************************************************************
 *                                 头文件引用                                 *
 ******************************************************************************/

/******************************************************************************
 *                                 宏、定义、结构体                           *
 ******************************************************************************/

/******************************************************************************
 *                                 函数声明                                   *
 ******************************************************************************/
extern const unsigned char stfdata_addr[];
extern int stfdata_length;

#ifdef __cplusplus
}
#endif

#endif  /* STFDATA_H */

/* 文件结束 */

